End_run/run1/constant/solidificationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidificationProperties;
}

Tsolid      273.15;                       // [K]
Tliquid     273.65;                       // [K]
Tref        273.15;                       // [K]
Treg        275.15;                       // [K]
latentHeat  300e3;                       // [J/kg]

water
{
    rho               1100;
    rhoLiquid         1100;                 // [kg/m^3]
    rhoSolid          980;                  // [kg/m^3]
    cpLiquid          3500;                 // [J/(kg*K)]
    cpSolid           2000;                 // [J/(kg*K)]


    lambda            0.6;                // [W/(m*K)]
    lambdaSolid       2.26;                // [W/(m*K)]
    lambdaLiquid      0.6;                // [W/(m*K)]
}

contactFluid
{
    rho           1400;                   // [kg/m^3]    
    cp            2000;
    lambda        1.0;
}

air
{
    rho          1.2;                     // [kg/m^3]
    cp           1005;                    // [J/(kg*K)]
    lambda       0.03;                    // [W/(m*K)]
}
heatTransfer
{
    // water - contactFluid
    K_wc    7.2e6;                       

    // water - air
    K_wa    4.8e5;                         

    // contactFluid - air
    K_ca    0;                
}

